TexasInstruments/mcupsdk-core/examples/drivers/epwm/epwm_illegal_combo_logic/am261x-som/r5fss0-0_nortos/example.syscfg
icl_xbar1.$name      = "CONFIG_ICL_XBAR0";
icl_xbar1.xbarOutput = ["MDL0_OUTA"];

icl_xbar2.$name      = "CONFIG_ICL_XBAR1";
icl_xbar2.xbarOutput = ["MDL0_OUTB"];
icl_xbar2.instance   = "ICL_XBAR_1";

icl_xbar3.$name      = "CONFIG_ICL_XBAR2";
icl_xbar3.xbarOutput = ["MDL3_OUTA"];
icl_xbar3.instance   = "ICL_XBAR_2";

icl_xbar4.$name      = "CONFIG_ICL_XBAR3";
icl_xbar4.xbarOutput = ["MDL3_OUTB"];
icl_xbar4.instance   = "ICL_XBAR_3";

icl_xbar5.$name      = "CONFIG_ICL_XBAR4";
icl_xbar5.xbarOutput = ["MDL5_OUTA"];
icl_xbar5.instance   = "ICL_XBAR_4";

icl_xbar6.$name      = "CONFIG_ICL_XBAR5";
icl_xbar6.xbarOutput = ["MDL5_OUTB"];
icl_xbar6.instance   = "ICL_XBAR_5";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$assign               = "GPIO43";
epwm1.EPWM.B.$assign               = "GPIO44";
epwm2.EPWM.A.$assign               = "GPIO45";
epwm3.EPWM.A.$assign               = "GPIO47";
epwm3.EPWM.B.$assign               = "GPIO48";
epwm4.EPWM.A.$assign               = "GPIO49";
epwm5.EPWM.A.$assign               = "GPIO51";
epwm5.EPWM.B.$assign               = "GPIO52";
epwm6.EPWM.A.$assign               = "GPIO53";
epwm6.EPWM.B.$assign               = "GPIO54";
epwm7.EPWM.A.$assign               = "GPIO55";
mcspi1.SPI.$suggestSolution                 = "SPI1";
debug_log.uartLog.UART.$suggestSolution     = "UART0";
